-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/pablobarbera/Dropbox/research/twitter-trolls/replication/replic
> ation-ts.log
  log type:  text
 opened on:  19 Oct 2016, 14:43:29

. clear all

. 
. ** opening and appending data
. use "germany-time-series.dta"
(Written by R.              )

. append using "uk-time-series.dta", force
(note: variable party was str17, now str35 to accommodate using data's values)
(note: variable name was str26, now str28 to accommodate using data's values)

. append using "spain-time-series.dta", force
(note: variable name was str28, now str69 to accommodate using data's values)

. append using "greece-time-series.dta", force
(note: variable party was str35, now str60 to accommodate using data's values)

. 
. ** strings to factors
. encode(country), gen(code)

. encode(electability), gen(elec)

. encode(twitter), gen(id)

. gen logfoll = log(followers_count+1)
(328 missing values generated)

. gen voteshare = votenl/100

. table country

----------------------
  country |      Freq.
----------+-----------
  Germany |        468
   Greece |        396
    Spain |        900
       UK |      1,216
----------------------

. 
. ** computing weights
. by twitter, sort: egen sumtweets = sum(ntweets)

. sum ntweets

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     ntweets |      2980    36.07584    76.91307          0       1160

. gen weight = 1/(sumtweets / r(mean))
(404 missing values generated)

. 
. ** dropping missing values
. drop if engaging_tweets == .
(727 observations deleted)

. drop if ntweets < 2
(183 observations deleted)

. 
. ** keeping only first 3 weeks
. drop if week == 4
(418 observations deleted)

. 
. ** setting TSCS structure of data
. xtset id week
       panel variable:  id (unbalanced)
        time variable:  week, 1 to 3, but with gaps
                delta:  1 unit

. 
. 
. ** Table 3 ***
.         
. xtreg d.impolite_mentions l.engaging_tweets [pweight=weight], fe cluster(id)

Fixed-effects (within) regression               Number of obs      =       907
Group variable: id                              Number of groups   =       505

R-sq:  within  = 0.1001                         Obs per group: min =         1
       between = 0.0010                                        avg =       1.8
       overall = 0.0000                                        max =         2

                                                F(1,504)           =      4.12
corr(u_i, Xb)  = -0.7911                        Prob > F           =    0.0428

                                      (Std. Err. adjusted for 505 clusters in id)
---------------------------------------------------------------------------------
D.              |               Robust
impolite_ment~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .2784413   .1371277     2.03   0.043      .009029    .5478537
                |
          _cons |  -.1160898   .0560135    -2.07   0.039    -.2261385   -.0060412
----------------+----------------------------------------------------------------
        sigma_u |  .05977672
        sigma_e |  .08280675
            rho |  .34258703   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimates store m1, title("All")

. 
. margins, dyex(*)

Average marginal effects                          Number of obs   =        907
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/ex w.r.t. : L.engaging_tweets

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/ex   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .1137368   .0560135     2.03   0.042     .0039524    .2235212
---------------------------------------------------------------------------------

. sum engaging_tweets

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
engaging_t~s |      1652    .4124117    .1892352   .0045098   .9833333

. di  .1892352  * .2784413  
.0526909

. sum impolite_mentions

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
impolite_m~s |      1519    .0625076    .0720724          0       .805

. di  (.1892352  * .2784413)/.0720724 
.73108284

. 
. xtreg d.impolite_mentions l.engaging_tweets [pweight=weight] if country=="UK", fe
>  cluster(id)

Fixed-effects (within) regression               Number of obs      =       339
Group variable: id                              Number of groups   =       212

R-sq:  within  = 0.0261                         Obs per group: min =         1
       between = 0.0137                                        avg =       1.6
       overall = 0.0138                                        max =         2

                                                F(1,211)           =      2.29
corr(u_i, Xb)  = -0.1612                        Prob > F           =    0.1317

                                      (Std. Err. adjusted for 212 clusters in id)
---------------------------------------------------------------------------------
D.              |               Robust
impolite_ment~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .0749597   .0495367     1.51   0.132    -.0226906      .17261
                |
          _cons |  -.0499184   .0263272    -1.90   0.059    -.1018164    .0019796
----------------+----------------------------------------------------------------
        sigma_u |   .0337002
        sigma_e |   .0450672
            rho |  .35863314   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimates store m2, title("UK")

. 
. xtreg d.impolite_mentions l.engaging_tweets [pweight=weight] if country=="Spain",
>  fe cluster(id)

Fixed-effects (within) regression               Number of obs      =       370
Group variable: id                              Number of groups   =       187

R-sq:  within  = 0.1300                         Obs per group: min =         1
       between = 0.0153                                        avg =       2.0
       overall = 0.0022                                        max =         2

                                                F(1,186)           =      0.97
corr(u_i, Xb)  = -0.8320                        Prob > F           =    0.3265

                                      (Std. Err. adjusted for 187 clusters in id)
---------------------------------------------------------------------------------
D.              |               Robust
impolite_ment~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .3524678   .3582612     0.98   0.326      -.35431    1.059246
                |
          _cons |  -.1511933   .1524074    -0.99   0.322    -.4518627    .1494761
----------------+----------------------------------------------------------------
        sigma_u |  .04425627
        sigma_e |  .08474519
            rho |  .21428223   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimates store m3, title("Spain")

. 
. xtreg d.impolite_mentions l.engaging_tweets [pweight=weight] if country=="Germany
> ", fe cluster(id)

Fixed-effects (within) regression               Number of obs      =       123
Group variable: id                              Number of groups   =        64

R-sq:  within  = 0.2257                         Obs per group: min =         1
       between = 0.0510                                        avg =       1.9
       overall = 0.0003                                        max =         2

                                                F(1,63)            =      3.86
corr(u_i, Xb)  = -0.8970                        Prob > F           =    0.0539

                                       (Std. Err. adjusted for 64 clusters in id)
---------------------------------------------------------------------------------
D.              |               Robust
impolite_ment~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .4277292   .2177745     1.96   0.054    -.0074584    .8629168
                |
          _cons |  -.0870226   .0479011    -1.82   0.074    -.1827452       .0087
----------------+----------------------------------------------------------------
        sigma_u |  .07903904
        sigma_e |  .11079814
            rho |  .33725834   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimates store m4, title("Germany")

. 
. xtreg d.impolite_mentions l.engaging_tweets [pweight=weight] if country=="Greece"
> , fe cluster(id)

Fixed-effects (within) regression               Number of obs      =        75
Group variable: id                              Number of groups   =        42

R-sq:  within  = 0.0580                         Obs per group: min =         1
       between = 0.0007                                        avg =       1.8
       overall = 0.0013                                        max =         2

                                                F(1,41)            =      1.94
corr(u_i, Xb)  = -0.5505                        Prob > F           =    0.1713

                                       (Std. Err. adjusted for 42 clusters in id)
---------------------------------------------------------------------------------
D.              |               Robust
impolite_ment~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
engaging_tweets |
            L1. |   .4109312   .2950947     1.39   0.171    -.1850246    1.006887
                |
          _cons |   -.057414   .0488508    -1.18   0.247    -.1560703    .0412422
----------------+----------------------------------------------------------------
        sigma_u |  .09688706
        sigma_e |  .11565276
            rho |  .41239035   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimates store m5, title("Greece")

.         
. 
. ** Generating table
. estout m1 m2 m3 m4 m5 /*displays models 1-5*/ ///
>         using "tabl3.tex", replace style(tex) ///
>         title(OLS regressions of impolite tweets received on engaging tweets sent
> , with candidate fixed effects.) ///
>         prehead(        \def\one{\footnotesize{$\ast$}} ///
>                                 \def\two{\footnotesize{$\ast\ast$}} ///
>                                 \def\three{\footnotesize{$\ast\ast$$\ast$}} ///
>                                 \begin{table}[h!]\caption{@title} ///
>                                 \label{tab:table4} ///
>                                 \centering\begin{threeparttable}\begin{tabular}{l
> *{@M}{r@{}l}}\hline\hline ///
>                                 ) ///
>         collabels(none) /*hides labels of columns*/ ///
>         posthead(\hline\\) ///
>         cells(b(star fmt(%9.2f)) se(par)) /*displays coefs with 1 decimal*/ ///
>         starlevels(\one 0.10 \two 0.05 \three 0.01) ///
>                 /*reported levels of significance can changed*/ ///
>         varlabels(_cons Constant L.engaging_tweets "\% Engaging tweets sent (lagg
> ed)") /*modify label of constant*/ ///
>         prefoot(\\\hline) ///
>         stats(N_clust N r2, fmt(%9.0g %9.0g %9.2f ) labels("N (candidates)" "N (o
> bservations)" "$R^2$")) ///
>         nolegend /*hides significance symbols legend (I'll do it manually)*/ ///
>         label  /*make use of variable labels*/ ///
>         stardetach /*display stars in separated column*/ ///
>         wrap varwidth(30) ///
>         postfoot( ///
>                                 \hline\hline\end{tabular} \begin{tablenotes} ///
>                                 \item \footnotesize{Dependent variable: Change in
>  proportion of engaging tweets sent, by week. ///
>                                         Robust standard errors in parentheses. //
> /
>                                 Signif.: \one 10\% \two 5\% \three 1\%.} ///
>                                 \end{tablenotes}\end{threeparttable}\end{table} /
> //
>                                 )       
(note: file tabl3.tex not found)
(output written to tabl3.tex)

.         
.         
.         
. log close       
      name:  <unnamed>
       log:  /Users/pablobarbera/Dropbox/research/twitter-trolls/replication/replic
> ation-ts.log
  log type:  text
 closed on:  19 Oct 2016, 14:43:30
-----------------------------------------------------------------------------------
